Revit 2027 API
FabricationPartType.ResetAssemblyTypes Method
 Resets the assembly types of all assembly instances with one or more FabricationPart element. The document where the assemblies with FabricationPart will be reset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ResetAssemblyTypes(
	Document document
)
Public Shared Sub ResetAssemblyTypes (
	document As Document
)
public:
static void ResetAssemblyTypes(
	Document^ document
)
static member ResetAssemblyTypes :
        document : Document -> unit
Parameters
document Document
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPartType Class
Autodesk.Revit.DB Namespace